# St7GetGeometryEdgeBeamProperty

Returns the beam property number to be created by the automesher on the specified geometry edge.

long St7GetGeometryEdgeBeamProperty(long uID, long EdgeNum, long* PropNum)

Input Parameters

uID

Strand7 model file ID.

Edge Attributes – Get

EdgeNum

Edge number.

Output Parameters

PropNum

Edge beam property on the geometry edge.